Lets start forom the official pandas Book

In [38]:
import numpy as np 
import pandas as pd

How to create a series

In [40]:

s=pd.Series([1,2,3,4,np.nan,6,7,8])

In [41]:
s

0    1.0
1    2.0
2    3.0
3    4.0
4    NaN
5    6.0
6    7.0
7    8.0
dtype: float64

In [48]:
dates=pd.date_range("2023-01-01", periods=6)

In [49]:
df=pd.DataFrame(np.random.randn(6,4),index=dates, columns=list("ABCD"))

In [50]:
df

                   A         B         C         D
2023-01-01  1.191530 -0.238504  1.070772  1.412267
2023-01-02  0.511157  2.369019 -0.098649 -1.276739
2023-01-03  0.126193 -0.784293  2.570136  0.506555
2023-01-04 -0.531486 -1.033240  0.666290  0.341595
2023-01-05  0.317871 -0.135089 -0.498802 -0.654008
2023-01-06 -0.165838  2.111152 -1.723555 -0.730620

In [54]:
sd=np.random.randn(4,4)

In [55]:
sd

array([[ 1.48059156, -1.28088568, -0.11379245, -0.34123617],
       [-0.91831932, -0.22345699, -0.7420827 ,  0.74632535],
       [-2.59542226,  0.5278211 , -1.22801262, -0.04756595],
       [ 0.2960531 ,  0.50626929,  1.37994549, -1.50864129]])

In [11]:
import pandas as pd

In [4]:
df1=pd.DataFrame({"A":[1,2,3], "B":[2,3,4]})
df2=pd.DataFrame({"A":[3,4,6],"B":[7,9,11]})

In [9]:
result=pd.concat([df1,df2], ignore_index=False)

In [22]:
result

   A   B
0  1   2
1  2   3
2  3   4
0  3   7
1  4   9
2  6  11

In [21]:
df3=pd.DataFrame({"A":[2,3,4], "C":[8,9,0]})
df4=pd.DataFrame({"D":[1,1,1],"E":[0,0,0]})

In [13]:
result1=df3.join(df4)

In [14]:
result1

   A  C  D  E
0  2  8  1  0
1  3  9  1  0
2  4  0  1  0

In [39]:
df5=pd.DataFrame({"Id":[1,2,3], "name":["Ali","khan","Dani"]})
df6=pd.DataFrame({"Id":[2,3,4], "score":[85,90,95]})

In [40]:
result=pd.merge(df5,df6 )

In [41]:
result

   Id  name  score
0   2  khan     85
1   3  Dani     90

In [43]:
dfg=pd.DataFrame({"Team":["A","A","B","B","c"], "score":[10,20,30,25,40]})

In [50]:
result=dfg.groupby("score")["Team"].min()

In [51]:
result

score
10    A
20    A
25    B
30    B
40    c
Name: Team, dtype: object

In [1]:
import pandas as pd

In [2]:
stud=pd.DataFrame({"Name":["Priya","Aditya","Krisha","Vedant","Parshv","Mittal","Archana"],"Marks":[98,89,99,87,90,83,99],
"Gender":['Male','Female','Female','Male','Male','Female','Female']})

In [3]:
stud

      Name  Marks  Gender
0    Priya     98    Male
1   Aditya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [4]:
#### First print top 3 rows
stud.head(3)

     Name  Marks  Gender
0   Priya     98    Male
1  Aditya     89  Female
2  Krisha     99  Female

In [5]:
### Print last 3 rows
stud.tail(3)

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [6]:
### Find shape of a Data Frame
stud.shape

(7, 3)

In [7]:
print("Number of Rows :", stud.shape[0])
print("Number of columns :", stud.shape[1])

Number of Rows : 7
Number of columns : 3

In [8]:
### Find details of dataFrame
stud.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 300.0+ bytes

In [9]:
### Check null values in dataFrame
stud.isnull()
stud.isnull().sum(axis=0)  ### axis 1 is for rows

Name      0
Marks     0
Gender    0
dtype: int64

In [10]:
## Get overall statistics
stud.describe()  ### here we have only one numericall so they just taken marks

           Marks
count   7.000000
mean   92.142857
std     6.491753
min    83.000000
25%    88.000000
50%    90.000000
75%    98.500000
max    99.000000

In [11]:
## for all statistic we need include() method
stud.describe(include='all')

         Name      Marks  Gender
count       7   7.000000       7
unique      7        NaN       2
top     Priya        NaN  Female
freq        1        NaN       4
mean      NaN  92.142857     NaN
std       NaN   6.491753     NaN
min       NaN  83.000000     NaN
25%       NaN  88.000000     NaN
50%       NaN  90.000000     NaN
75%       NaN  98.500000     NaN
max       NaN  99.000000     NaN

In [12]:
### Find unique Values in dataFrame rows
stud['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [13]:
### Find unique Values in dataFrame columns
stud['Gender'].nunique()

2

In [14]:
## Display Count of unique values in Gender Column 
stud["Gender"].value_counts()

Gender
Female    4
Male      3
Name: count, dtype: int64

In [15]:
### Find Total number of Students Having Marks Between 90 to 100 (inclusive) using Between method
stud['Marks']

0    98
1    89
2    99
3    87
4    90
5    83
6    99
Name: Marks, dtype: int64

In [17]:
stud[['Marks']>=90]

TypeError: '>=' not supported between instances of 'list' and 'int'